ProgessBase/InformationRegisters/СоответствиеПодразделенийИПодразделенийОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеПодразделенийИПодразделенийОрганизаций</Name>
			<Comment>Соответствие подразделений и подразделений организаций</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/СхемыМотивацииРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СхемыМотивацииРаботников</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифныйРазряд6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УправленческиеУдержания</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УправленческиеНачисления</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСхемыМотивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыCхемМотивации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/ВидыОрганизационнойСтруктурыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОрганизационнойСтруктурыПредприятия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСтруктуреЮридическихЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦентрамОтветственности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Enums/ИспытательныйСрок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ИспытательныйСрок</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СИспытательнымСроком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезИспытательногоСрока</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Enums/ВидыДоговоровСФизЛицами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровСФизЛицами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Авторский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЛицензионный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорУправленческий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодразделения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриториальныеУсловияПФР</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриториальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AVT_ЦентрУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVT_ЦентрУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AVT_ИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетСудамПодФлагомРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГДивизион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГДивизионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГДопОфис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГДопОфисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГЭтоБухЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_ЦентрУчетаЗатрат2014</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ЦентрыУчетаЗатрат2014</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_СтарыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСолво</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/CommonModules/ПриемНаРаботуВОрганизациюПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции объекта

Процедура ДополнитьСтруктуруПечатныхФорм(СтруктураПечатныхФорм, ДокументОбъект) Экспорт
	
	ПриемНаРаботуВОрганизациюДополнительный.ДополнитьСтруктуруПечатныхФорм(СтруктураПечатныхФорм, ДокументОбъект);
	
КонецПроцедуры

Функция ПечатьДополнительныхФорм(ИмяМакета, Объект) Экспорт
	
	Возврат ПриемНаРаботуВОрганизациюДополнительный.ПечатьДополнительныхФорм(ИмяМакета, Объект);
	
КонецФункции

Функция ВыполняетсяДополнительноеУсловиеИДействие(ИмяРегистра, Движение = Неопределено, ВыборкаПоРаботникиОрганизации, ВыборкаПоШапкеДокумента) Экспорт
	
	мДлинаСуток = 86400;
	
	Если НЕ ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда
		
		Если ИмяРегистра = "РаботникиОрганизаций" Тогда
			// Свойства
			Движение.ПериодЗавершения						= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
			// Ресурсы
			Движение.ПодразделениеОрганизацииЗавершения		= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
			Движение.ДолжностьЗавершения					= ВыборкаПоРаботникиОрганизации.Должность;
			// Реквизиты
			Движение.ПричинаИзмененияСостоянияЗавершения	= Перечисления.ПричиныИзмененияСостояния.Увольнение;
			Движение.ОбособленноеПодразделениеЗавершения	= ВыборкаПоШапкеДокумента.Организация;
		ИначеЕсли ИмяРегистра = "ПериодыРаботыРаботниковОрганизацийПоСовместительству" Или ИмяРегистра = "ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы" Тогда
			Движение.ДатаОкончания	= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
		КонецЕсли;
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Функция ВыполнятьДвижениеПоСостояниеРаботниковНаИспытательномСроке(ВыборкаПоРаботникиОрганизации) Экспорт
	
	РежимНабораПерсонала = ПроцедурыУправленияПерсоналомДополнительный.ПолучитьРежимНабораПерсонала();
	
	ВедетсяНаборПерсонала = РежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;

	Возврат ВедетсяНаборПерсонала И ВыборкаПоРаботникиОрганизации.ВидЗанятости <> Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство;
	
КонецФункции

Процедура ЗаполнитьПоОснованию(Основание, ЭтотОбъект) Экспорт
	
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		
		// Заполним реквизиты из стандартного набора.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Если Основание.Проведен Тогда
			
			ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
			УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
			
			Если ЭтотОбъект.Организация.Пустая() Тогда
				ЭтотОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяОрганизация")
			КонецЕсли;
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Организация",			ЭтотОбъект.Организация);
			Запрос.УстановитьПараметр("Регистратор",			Основание);
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПриемНаРаботуРаботники.Сотрудник,
			|	ПриемНаРаботуРаботники.Сотрудник.Физлицо КАК ФизЛицо,
			|	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации,
			|	ПриемНаРаботуРаботники.Должность КАК Должность,
			|	ПриемНаРаботуРаботники.ЗанимаемыхСтавок,
			|	ПриемНаРаботуРаботники.ДатаПриема,
			|	ВЫБОР
			|		КОГДА ПриемНаРаботуРаботники.ИспытательныйСрок = ЗНАЧЕНИЕ(Перечисление.ИспытательныйСрок.СИспытательнымСроком)
			|			ТОГДА РАЗНОСТЬДАТ(ПриемНаРаботуРаботники.ДатаПриема, ПриемНаРаботуРаботники.ДатаУвольнения, МЕСЯЦ)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИспытательныйСрок,
			|	ПриемНаРаботуРаботники.ДатаУвольнения,
			|	ПриемНаРаботуРаботники.ГрафикРаботы,
			|	ИСТИНА КАК НапомнитьПоЗавершении
			/////автоматизация
			|	,ПриемНаРаботуРаботники.AVTШтатноеРасписание
			/////автоматизация
			|ИЗ
			|	Документ.ПриемНаРаботу.Работники КАК ПриемНаРаботуРаботники
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
			|		ПО (СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация)
			|			И ПриемНаРаботуРаботники.Подразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение
			|ГДЕ
			|	ПриемНаРаботуРаботники.Ссылка = &Регистратор";
			
			ЭтотОбъект.РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
			
		КонецЕсли;
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		
		Если Основание.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда
			ИЛИ Основание.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Авторский Тогда
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",	Основание);
		
		// ИЗМЕНЕНИЕ: Петрухин Андрей 22.06.2011 22:34  
		// Добавили "ШтатноеРасписание"
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|	ВложенныйЗапрос.Физлицо КАК Физлицо,
		|	ВложенныйЗапрос.Должность,
		|	ВложенныйЗапрос.ПодразделениеОрганизации,
		|	ВложенныйЗапрос.ЗанимаемыхСтавок,
		|	ВложенныйЗапрос.ДатаПриема КАК ДатаПриема,
		|	ВложенныйЗапрос.ДатаУвольнения КАК ДатаУвольнения,
		|	ВложенныйЗапрос.ИспытательныйСрок,
		|	ВложенныйЗапрос.ГрафикРаботы,
		|	ВложенныйЗапрос.ВидРасчета КАК ВидРасчета,
		|	ВложенныйЗапрос.Показатель1 КАК Показатель1,
		|	ВложенныйЗапрос.Показатель2 КАК Показатель2,
		|	ВложенныйЗапрос.Показатель3 КАК Показатель3,
		|	ВложенныйЗапрос.Показатель4 КАК Показатель4,
		|	ВложенныйЗапрос.Показатель5 КАК Показатель5,
		|	ВложенныйЗапрос.Показатель6 КАК Показатель6,
		|	ВложенныйЗапрос.Валюта1 КАК Валюта1,
		|	ВложенныйЗапрос.Валюта2 КАК Валюта2,
		|	ВложенныйЗапрос.Валюта3 КАК Валюта3,
		|	ВложенныйЗапрос.Валюта4 КАК Валюта4,
		|	ВложенныйЗапрос.Валюта5 КАК Валюта5,
		|	ВложенныйЗапрос.Валюта6 КАК Валюта6,
		|	ВложенныйЗапрос.ТарифныйРазряд1 КАК ТарифныйРазряд1,
		|	ВложенныйЗапрос.ТарифныйРазряд2 КАК ТарифныйРазряд2,
		|	ВложенныйЗапрос.ТарифныйРазряд3 КАК ТарифныйРазряд3,
		|	ВложенныйЗапрос.ТарифныйРазряд4 КАК ТарифныйРазряд4,
		|	ВложенныйЗапрос.ТарифныйРазряд5 КАК ТарифныйРазряд5,
		|	ВложенныйЗапрос.ТарифныйРазряд6 КАК ТарифныйРазряд6,
		|	ВложенныйЗапрос.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		|	ВложенныйЗапрос.Приоритет КАК Приоритет,
		|	ВложенныйЗапрос.AVTШтатноеРасписание
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		0 КАК Приоритет,
		|		ВЫБОР
		|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА СотрудникиОрганизаций.Организация
		|			ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
		|		КОНЕЦ КАК Организация,
		|		СотрудникиОрганизаций.Ссылка КАК Сотрудник,
		|		СотрудникиОрганизаций.Физлицо КАК Физлицо,
		|		СотрудникиОрганизаций.Должность КАК Должность,
		|		СотрудникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		СотрудникиОрганизаций.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|		СотрудникиОрганизаций.ДатаНачала КАК ДатаПриема,
		|		СотрудникиОрганизаций.ДатаОкончания КАК ДатаУвольнения,
		|		СотрудникиОрганизаций.ИспытательныйСрок КАК ИспытательныйСрок,
		|		СотрудникиОрганизаций.ГрафикРаботы КАК ГрафикРаботы,
		|		СотрудникиОрганизаций.ВидРасчета КАК ВидРасчета,
		|		СотрудникиОрганизаций.ТарифнаяСтавка КАК Показатель1,
		|		NULL КАК Показатель2,
		|		NULL КАК Показатель3,
		|		NULL КАК Показатель4,
		|		NULL КАК Показатель5,
		|		NULL КАК Показатель6,
		|		СотрудникиОрганизаций.ВалютаТарифнойСтавки КАК Валюта1,
		|		NULL КАК Валюта2,
		|		NULL КАК Валюта3,
		|		NULL КАК Валюта4,
		|		NULL КАК Валюта5,
		|		NULL КАК Валюта6,
		|		СотрудникиОрганизаций.ТарифныйРазряд КАК ТарифныйРазряд1,
		|		NULL КАК ТарифныйРазряд2,
		|		NULL КАК ТарифныйРазряд3,
		|		NULL КАК ТарифныйРазряд4,
		|		NULL КАК ТарифныйРазряд5,
		|		NULL КАК ТарифныйРазряд6,
		|		ИСТИНА КАК НапомнитьПоЗавершении,
		|		СотрудникиОрганизаций.AVTШтатноеРасписание КАК AVTШтатноеРасписание
		|	ИЗ
		|		Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|	ГДЕ
		|		СотрудникиОрганизаций.Ссылка = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		1,
		|		ВЫБОР
		|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА СотрудникиОрганизаций.Организация
		|			ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
		|		КОНЕЦ,
		|		СотрудникиОрганизаций.Ссылка,
		|		СотрудникиОрганизаций.Физлицо,
		|		СотрудникиОрганизаций.Должность,
		|		СотрудникиОрганизаций.ПодразделениеОрганизации,
		|		СотрудникиОрганизаций.ЗанимаемыхСтавок,
		|		СотрудникиОрганизаций.ДатаНачала,
		|		СотрудникиОрганизаций.ДатаОкончания,
		|		СотрудникиОрганизаций.ИспытательныйСрок,
		|		СотрудникиОрганизаций.ГрафикРаботы,
		|		ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РайонныйКоэффициент),
		|		ВЫБОР
		|			КОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
		|					И СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент > 1
		|				ТОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент
		|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА ВЫБОР
		|						КОГДА СотрудникиОрганизаций.Организация.РайонныйКоэффициент > 1
		|							ТОГДА СотрудникиОрганизаций.Организация.РайонныйКоэффициент
		|						ИНАЧЕ 1
		|					КОНЕЦ
		|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициент > 1
		|				ТОГДА СотрудникиОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициент
		|			ИНАЧЕ 1
		|		КОНЕЦ * 100 - 100,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		ИСТИНА,
		|		СотрудникиОрганизаций.AVTШтатноеРасписание
		|	ИЗ
		|		Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
		|						И СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент > 1
		|					ТОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент
		|				КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА ВЫБОР
		|							КОГДА СотрудникиОрганизаций.Организация.РайонныйКоэффициент > 1
		|								ТОГДА СотрудникиОрганизаций.Организация.РайонныйКоэффициент
		|							ИНАЧЕ 1
		|						КОНЕЦ
		|				КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициент > 1
		|					ТОГДА СотрудникиОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициент
		|				ИНАЧЕ 1
		|			КОНЕЦ > 1
		|		И СотрудникиОрганизаций.Ссылка = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		2,
		|		ВЫБОР
		|			КОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Организация
		|			ИНАЧЕ СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение
		|		КОНЕЦ,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Физлицо,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Должность,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ПодразделениеОрганизации,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ЗанимаемыхСтавок,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаНачала,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаОкончания,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ИспытательныйСрок,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ГрафикРаботы,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Надбавка,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Показатель1,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Показатель2,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Показатель3,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Показатель4,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Показатель5,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Показатель6,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Валюта1,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Валюта2,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Валюта3,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Валюта4,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Валюта5,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Валюта6,
		|		СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд1,
		|		СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд2,
		|		СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд3,
		|		СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд4,
		|		СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд5,
		|		СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд6,
		|		ИСТИНА,
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.AVTШтатноеРасписание
		|	ИЗ
		|		Справочник.СотрудникиОрганизаций.ПерсональныеНадбавки КАК СотрудникиОрганизацийПерсональныеНадбавки
		|	ГДЕ
		|		СотрудникиОрганизацийПерсональныеНадбавки.Ссылка = &Ссылка
		|		И СотрудникиОрганизацийПерсональныеНадбавки.Надбавка <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		3,
		|		ВЫБОР
		|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА СотрудникиОрганизаций.Организация
		|			ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
		|		КОНЕЦ,
		|		СотрудникиОрганизаций.Ссылка,
		|		СотрудникиОрганизаций.Физлицо,
		|		СотрудникиОрганизаций.Должность,
		|		СотрудникиОрганизаций.ПодразделениеОрганизации,
		|		СотрудникиОрганизаций.ЗанимаемыхСтавок,
		|		СотрудникиОрганизаций.ДатаНачала,
		|		СотрудникиОрганизаций.ДатаОкончания,
		|		СотрудникиОрганизаций.ИспытательныйСрок,
		|		СотрудникиОрганизаций.ГрафикРаботы,
		|		СхемыМотивацииРаботников.ВидРасчета,
		|		СхемыМотивацииРаботников.Показатель1,
		|		СхемыМотивацииРаботников.Показатель2,
		|		СхемыМотивацииРаботников.Показатель3,
		|		СхемыМотивацииРаботников.Показатель4,
		|		СхемыМотивацииРаботников.Показатель5,
		|		СхемыМотивацииРаботников.Показатель6,
		|		СхемыМотивацииРаботников.Валюта1,
		|		СхемыМотивацииРаботников.Валюта2,
		|		СхемыМотивацииРаботников.Валюта3,
		|		СхемыМотивацииРаботников.Валюта4,
		|		СхемыМотивацииРаботников.Валюта5,
		|		СхемыМотивацииРаботников.Валюта6,
		|		СхемыМотивацииРаботников.ТарифныйРазряд1,
		|		СхемыМотивацииРаботников.ТарифныйРазряд2,
		|		СхемыМотивацииРаботников.ТарифныйРазряд3,
		|		СхемыМотивацииРаботников.ТарифныйРазряд4,
		|		СхемыМотивацииРаботников.ТарифныйРазряд5,
		|		СхемыМотивацииРаботников.ТарифныйРазряд6,
		|		ИСТИНА,
		|		СотрудникиОрганизаций.AVTШтатноеРасписание
		|	ИЗ
		|		Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыМотивацииРаботников КАК СхемыМотивацииРаботников
		|			ПО (СхемыМотивацииРаботников.Организация = ВЫБОР
		|					КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|						ТОГДА СотрудникиОрганизаций.Организация
		|					ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
		|				КОНЕЦ)
		|				И (ВЫБОР
		|					КОГДА СхемыМотивацииРаботников.Должность <> ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)
		|							И СхемыМотивацииРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|						ТОГДА СхемыМотивацииРаботников.Должность = СотрудникиОрганизаций.Должность
		|								И СхемыМотивацииРаботников.Подразделение = СотрудникиОрганизаций.ПодразделениеОрганизации
		|					ИНАЧЕ СхемыМотивацииРаботников.Должность = СотрудникиОрганизаций.Должность
		|				КОНЕЦ)
		|	ГДЕ
		|		СхемыМотивацииРаботников.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		|		И СхемыМотивацииРаботников.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
		|		И СотрудникиОрганизаций.Ссылка = &Ссылка) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	Сотрудник,
		|	ВидРасчета";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "Организация");
			ЗаполнитьЗначенияСвойств(ЭтотОбъект.РаботникиОрганизации.Добавить(), Выборка);
			Пока Выборка.СледующийПоЗначениюПоля("ВидРасчета") Цикл
				Если  ЗначениеЗаполнено(Выборка.ВидРасчета) Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("ВидРасчета",Выборка.ВидРасчета);
					Отбор.Вставить("Сотрудник",Выборка.Сотрудник);
					Если ЭтотОбъект.ОсновныеНачисления.НайтиСтроки(Отбор).Количество() = 0 Тогда
						ЗаполнитьЗначенияСвойств(ЭтотОбъект.ОсновныеНачисления.Добавить(), Выборка);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Формирует запрос по таблице "ОсновныеНачисления" документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоНачисления(КонтрольРазмераСтавокШтатногоРасписания, ЭтотОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументСсылка", ЭтотОбъект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Ссылка,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.НомерСтроки,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель1,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта1,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель2,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта2,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель3,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта3,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель4,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта4,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель5,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта5,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель6,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта6,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд1,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд2,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд3,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд4,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд5,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд6,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.СпособРасчета,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.ТребуетВводаТарифногоРазряда,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.ПроизвольнаяФормулаРасчета
	|ПОМЕСТИТЬ ВТДанныеНачислений
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.ОсновныеНачисления КАК ПриемНаРаботуВОрганизациюОсновныеНачисления
	|ГДЕ
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Ссылка = &ДокументСсылка
	|	И (НЕ ПриемНаРаботуВОрганизациюОсновныеНачисления.Сторно)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
	|	ТЧРаботникиОрганизации.Должность,
	|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
	|	ТЧРаботникиОрганизации.ГрафикРаботы,
	|	ТЧРаботникиОрганизации.ДатаПриема,
	|	ТЧРаботникиОрганизации.ДатаУвольнения,
		///////////////////////////////////////////////////////////////{ООО "Автоматизация-Л" ДОРАБОТКА
	// Измайлова Полина 25.10.2011 15:30 
	|	ТЧРаботникиОрганизации.AVTШтатноеРасписание,
	////////////////////////////////////////////////////////////////ООО "Автоматизация-Л" ДОРАБОТКА} 
	|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|	И (НЕ ТЧРаботникиОрганизации.Сторно)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧНачисления.Ссылка КАК Ссылка,
	|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|	ТЧНачисления.Сотрудник КАК Сотрудник,
	|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
	|	ТЧРаботникиОрганизации.Должность,
	|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
	|	ТЧРаботникиОрганизации.ГрафикРаботы,
	|	ТЧРаботникиОрганизации.ДатаПриема КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать) КАК Действие,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизации.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаУвольнения, ДЕНЬ, 1)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ПериодЗавершения,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизации.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.ПустаяСсылка)
	|	КОНЕЦ КАК ДействиеЗавершения,
	|	ТЧНачисления.ВидРасчета КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.ВидРасчетаЗачетОтработанногоВремени
	|			ТОГДА """"
	|		ИНАЧЕ ТЧНачисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчетаИзмерение,
	|	ТЧНачисления.ВидРасчетаСпособРасчета КАК СпособРасчета,
	|	ТЧНачисления.ВидРасчетаЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	ТЧНачисления.ВидРасчетаТребуетВводаТарифногоРазряда КАК ТребуетВводаТарифногоРазряда,
	|	ТЧНачисления.ВидРасчетаПроизвольнаяФормулаРасчета КАК ПроизвольнаяФормулаРасчета,
	|	ТЧНачисления.Показатель1 КАК Показатель1,
	|	ТЧНачисления.Валюта1 КАК Валюта1,
	|	ТЧНачисления.ТарифныйРазряд1 КАК ТарифныйРазряд1,
	|	ТЧНачисления.Показатель2 КАК Показатель2,
	|	ТЧНачисления.Валюта2 КАК Валюта2,
	|	ТЧНачисления.ТарифныйРазряд2 КАК ТарифныйРазряд2,
	|	ТЧНачисления.Показатель3 КАК Показатель3,
	|	ТЧНачисления.Валюта3 КАК Валюта3,
	|	ТЧНачисления.ТарифныйРазряд3 КАК ТарифныйРазряд3,
	|	ТЧНачисления.Показатель4 КАК Показатель4,
	|	ТЧНачисления.Валюта4 КАК Валюта4,
	|	ТЧНачисления.ТарифныйРазряд4 КАК ТарифныйРазряд4,
	|	ТЧНачисления.Показатель5 КАК Показатель5,
	|	ТЧНачисления.Валюта5 КАК Валюта5,
	|	ТЧНачисления.ТарифныйРазряд5 КАК ТарифныйРазряд5,
	|	ТЧНачисления.Показатель6 КАК Показатель6,
	|	ТЧНачисления.Валюта6 КАК Валюта6,
			///////////////////////////////////////////////////////////////{ООО "Автоматизация-Л" ДОРАБОТКА
	// Измайлова Полина 25.10.2011 15:30 
	|	ТЧРаботникиОрганизации.AVTШтатноеРасписание КАК AVTШтатноеРасписание,
	////////////////////////////////////////////////////////////////ООО "Автоматизация-Л" ДОРАБОТКА} 
	|	ТЧНачисления.ТарифныйРазряд6 КАК ТарифныйРазряд6
	|ИЗ
	|	ВТДанныеНачислений КАК ТЧНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДокумента КАК ТЧРаботникиОрганизации
	|		ПО ТЧНачисления.Сотрудник = ТЧРаботникиОрганизации.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ПроцедурыУправленияПерсоналом.СформироватьЗапросПоПлановымНачислениям(Запрос.Выполнить().Выгрузить(), КонтрольРазмераСтавокШтатногоРасписания);
	
КонецФункции // СформироватьЗапросПоНачисления()

// Возвращает массив значений перечисления ВидыДоговоровСФизЛицами, для которых оформляется
// приказ о приеме на работу по форме Т-1
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   массив значений типа ПеречислениеСсылка.ВидыДоговоровСФизЛицами
//
Функция ВидыТрудовыхДоговоров() Экспорт

	МассивВидов = Новый Массив;
	МассивВидов.Добавить(Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор);

	Возврат МассивВидов
	
КонецФункции // ВидыТрудовыхДоговоров()

Функция ДополнительноеПолеТабличнойЧасти() Экспорт

	Возврат "ТЧРаботникиОрганизации.НапомнитьПоЗавершении,"

КонецФункции // ДополнительноеПолеТабличнойЧасти()

Процедура ДобавитьДополнительноПоСтроке(ДокументОбъект, СтрокаТабличнойЧасти) Экспорт
	
	ПриемНаРаботуВОрганизациюДополнительный.ДобавитьДополнительноПоСтроке(ДокументОбъект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

Процедура ДобавитьДополнительныеДвижения(ДокументОбъект, Отказ, Заголовок) Экспорт
	
	ПриемНаРаботуВОрганизациюДополнительный.ДобавитьДополнительныеДвижения(ДокументОбъект, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ДозаполнитьСтрокуТаблицыРаботникиОрганизации(СтрокаТабличнойЧасти) Экспорт

	СтрокаТабличнойЧасти.НапомнитьПоЗавершении = Истина;

КонецПроцедуры

Процедура ДвиженияНаДатуУвольненияДополнительно(Движение) Экспорт
	
	ПриемНаРаботуВОрганизациюДополнительный.ДвиженияНаДатуУвольненияДополнительно(Движение);
	
КонецПроцедуры

Процедура ДополнитьДвиженияПоСостояниюРаботниковНаИспытательномСроке(Движение, ВыборкаПоРаботникиОрганизации) Экспорт
	
	ПриемНаРаботуВОрганизациюДополнительный.ДополнитьДвиженияПоСостояниюРаботниковНаИспытательномСроке(Движение, ВыборкаПоРаботникиОрганизации);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы документа

#Если ТолстыйКлиентОбычноеПриложение Тогда

Процедура ДополнитьКнопкиКоманднойПанели(КоманднаяПанель, Действие) Экспорт
	
	ИспользоватьУправленческийУчетЗарплаты = глЗначениеПеременной("глИспользоватьУправленческийУчетЗарплаты");
	
	Если ИспользоватьУправленческийУчетЗарплаты Тогда
	
		КнопкаЗаполнитьПринятымиВКомпанию = КоманднаяПанель.Кнопки.Добавить("ЗаполнитьПринятымиВКомпанию", ТипКнопкиКоманднойПанели.Действие, "Работниками, принятыми в компанию", Действие);
		КнопкаЗаполнитьПринятымиВКомпанию.Подсказка = "Работниками, принятыми в компанию";
		КнопкаЗаполнитьПринятымиВКомпанию.ИзменяетДанные = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ДополнитьСоставКолонок(Форма) Экспорт
	
	РаботаСДиалогами.ВставитьКолонкуВТабличноеПоле(8, Форма.ЭлементыФормы.РаботникиОрганизации, "НапомнитьПоЗавершении", "Регистрировать увольнение отдельным документом", , "НапомнитьПоЗавершении", , Ложь, , ПоложениеКолонки.ВТойЖеКолонке);
	
	ПриемНаРаботуВОрганизациюДополнительный.ДополнитьСоставКолонок(Форма);
	
КонецПроцедуры

// Процедура обеспечивает начальное значение реквизитов "ЗанимаемыхСтавок" 
//  и "ИспытательныйСрок"
//
// Параметры:
//  Элемент - табличное поле, которое отображает т.ч.
//  НоваяСтрока - булево, признак редактирования новой строки
//  
Процедура РаботникиОрганизацииПриНачалеРедактирования(Элемент, НоваяСтрока) Экспорт
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.НапомнитьПоЗавершении = Истина;
	КонецЕсли;
	
КонецПроцедуры // РаботникиОрганизацииПриНачалеРедактирования()

Процедура РаботникиОрганизацииПриПолученииДанных(Элемент, ОформленияСтрок, РаботникиОрганизации) Экспорт
	
	ТолькоПросмотрНапоминания = РаботникиОрганизации.Итог("НапомнитьПоЗавершении") = РаботникиОрганизации.Количество();
	
	Для Каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		ОформлениеСтроки.Ячейки.НапомнитьПоЗавершении.ТолькоПросмотр = ТолькоПросмотрНапоминания;
	КонецЦикла;
	
	ПриемНаРаботуВОрганизациюДополнительный.РаботникиОрганизацийПриПолученииДанныхДополнительно(Элемент, ОформленияСтрок);
	
КонецПроцедуры

Процедура ВыполнитьДополнительныеДействия(Кнопка, Объект, НастройкаПериода, Форма) Экспорт
	
	Если Кнопка.Имя = "ЗаполнитьПринятымиВКомпанию" Тогда
		
		Если Объект.РаботникиОрганизации.Количество()>0 Тогда
			ТекстВопроса = "Имеющийся список сотрудников будет очищен. Продолжить?";
			Ответ  = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Если Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкаПериода.Редактировать() Тогда
			ПриемНаРаботуВОрганизациюДополнительный.ЗаполнитьТабличнуюЧастьРаботникиПринятымиВКомпанию(Объект, НастройкаПериода.ПолучитьДатуНачала(), НастройкаПериода.ПолучитьДатуОкончания());
		КонецЕсли;
	
	КонецЕсли;

	ПриемНаРаботуВОрганизациюДополнительный.ВыполнитьДополнительныеДействия(Форма, Кнопка);
	
КонецПроцедуры

Процедура ПриИзмененииПодразделенияДолжностиДополнительно(ЭтаФорма) Экспорт
	
	ДанныеСтроки = ЭтаФорма.ЭлементыФормы.РаботникиОрганизации.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ГрафикРаботы) Тогда
			// ИЗМЕНЕНИЕ: Петрухин Андрей 22.06.2011 23:45  
		//Добавили вызов "штатноеРасписание"
		ДанныеШР = ПроцедурыУправленияПерсоналомПереопределяемый.СведенияОПозицииШтатногоРасписания(ЭтаФорма.Дата, ДанныеСтроки.ПодразделениеОрганизации, ДанныеСтроки.Должность, ДанныеСтроки.AVTШтатноеРасписание);
	
		Если ДанныеШР.Количество() > 0 Тогда
			ДанныеСтроки.ГрафикРаботы = ДанныеШР[0].ГрафикРаботы;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ФормаДокументаПередОткрытиемДополнительно(Форма, ДополнительныеДействия, ДополнительныеОбработчики) Экспорт
	
	ПриемНаРаботуВОрганизациюДополнительный.ФормаДокументаПередОткрытиемДополнительно(Форма, ДополнительныеДействия, ДополнительныеОбработчики);
	
КонецПроцедуры

Процедура ОбработатьДополнительноПриИзменении(Форма, Элемент) Экспорт
	
	ПриемНаРаботуВОрганизациюДополнительный.ОбработатьДополнительноПриИзменении(Форма, Элемент);
	
КонецПроцедуры

Процедура УдалитьДополнительноПоСтроке(Форма, Сотрудник) Экспорт
	
	ПриемНаРаботуВОрганизациюДополнительный.УдалитьДополнительноПоСтроке(Форма, Сотрудник);
	
КонецПроцедуры

Процедура ФормаДокументаРаботникиПослеУдаленияСтрокиДополнительно(Форма) Экспорт
	
	ПриемНаРаботуВОрганизациюДополнительный.ФормаДокументаРаботникиПослеУдаленияСтрокиДополнительно(Форма);
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы списка

Процедура ФормаСпискаПередОткрытиемДополнительно(ФормаСписка) Экспорт
		
    ПриемНаРаботуВОрганизациюДополнительный.ФормаСпискаПередОткрытиемДополнительно(ФормаСписка);
	
КонецПроцедуры // ФормаСпискаПередОткрытиемДополнительно

#КонецЕсли
